projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЗагрузкаРееструТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаРееструТД</Name>
			<Comment>Загрузка транзитных деклараций из CSV-файла Владимира. Matcher по колонке «Номер ДДП ТД».</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлCSV</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокКомплекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокНовыеТД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокПроблемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокТолькоОбеспечение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредложенияКлассификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type><v8:Type>xs:boolean</v8:Type></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Comment>Комплекс / НоваяТД / Проблема / ТолькоОбеспечение</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>30</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегНомерТД</Name>
							<Comment>CSV col #12</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДДПТД</Name>
							<Comment>CSV col #33 — ключ matcher'а</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>CSV col #4 — справочная информация</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>100</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декларант</Name>
							<Comment>CSV col #15</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыпуска</Name>
							<Comment>CSV col #28</Comment>
							<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКодовТНВЭД</Name>
							<Comment>CSV col #45 — готовое для Schema 4</Comment>
							<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаДокумент</Name>
							<Comment>Найденная ссылка на ОперацияПоПоручительству (для Комплекс/ТолькоОбеспечение)</Comment>
							<Type><v8:Type>cfg:DocumentRef.ОперацияПоПоручительству</v8:Type></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Comment>Номер строки ТЧ ДанныеДокументов, если найдена</Comment>
							<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>5</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПолучателя</Name>
							<Comment>CSV col #47 — для lookup контрагента</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>12</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолучателя</Name>
							<Comment>CSV col #16</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПроцесса</Name>
							<Comment>CSV col #6</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>CSV col #13</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Comment>Причина ошибки matcher'а или результат apply</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>500</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>true</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ТипыУчетаКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУчетаКлиентов</Name>
			<Comment>Определяет какие услуги рассчитывать для клиента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комплекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоОбеспечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоТД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ВидыОперацийПоручительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоручительства</Name>
			<Comment>Различение источника документа: ДДП (автозагрузка из API Сигмы) или ТД (ручная загрузка файла Владимира)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДДПАвто</Name>
					<Comment>Договор-поручительство, загруженный автоматически через API Сигма-Софт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТДФайл</Name>
					<Comment>Транзитная декларация, полученная из реестра ЭТД Владимира (CSV-файл)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЗагрузкаРееструТД/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Прочитать CSV Владимира (кодировка windows-1251, разделитель ";").
// Возвращает таблицу значений с 51 типизированной колонкой.
//
// Параметры:
//   ПутьКФайлу - Строка - полный путь к CSV
//
// Возвращаемое значение:
//   ТаблицаЗначений - колонки соответствуют структуре CSV_STRUCTURE.md
//
Функция ПрочитатьCSVФайл(ПутьКФайлу) Экспорт

	Результат = СоздатьТаблицуCSV();

	Попытка
		ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.ANSI);
	Исключение
		ЗаписьЖурналаРегистрации(
			"РусскийТранзит.ЗагрузкаРееструТД.ОткрытиеФайла",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			СтрШаблон("Не удалось открыть файл «%1»: %2", ПутьКФайлу, ОписаниеОшибки()));
		ВызватьИсключение СтрШаблон("Не удалось открыть файл реестра ТД. Проверьте путь и доступ. Файл: %1", ПутьКФайлу);
	КонецПопытки;

	СтрокаЗаголовка = ЧтениеТекста.ПрочитатьСтроку();
	Если СтрокаЗаголовка = Неопределено Тогда
		ЧтениеТекста.Закрыть();
		ВызватьИсключение "Файл пуст или не удалось прочитать заголовок";
	КонецЕсли;

	НомерСтроки = 1;
	Строка = ЧтениеТекста.ПрочитатьСтроку();
	Пока Строка <> Неопределено Цикл
		НомерСтроки = НомерСтроки + 1;
		Если ПустаяСтрока(Строка) Тогда
			Строка = ЧтениеТекста.ПрочитатьСтроку();
			Продолжить;
		КонецЕсли;

		Попытка
			Поля = РазобратьСтрокуCSV(Строка);
			ДобавитьСтрокуВТаблицу(Результат, Поля);
		Исключение
			ЗаписьЖурналаРегистрации(
				"РусскийТранзит.ЗагрузкаРееструТД.Парсер",
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				СтрШаблон("Строка %1: %2. Исходная строка: %3", НомерСтроки, ОписаниеОшибки(), Лев(Строка, 200)));
		КонецПопытки;

		Строка = ЧтениеТекста.ПрочитатьСтроку();
	КонецЦикла;

	ЧтениеТекста.Закрыть();

	Возврат Результат;

КонецФункции

// Сопоставить строки CSV с документами в базе. Возвращает таблицу со всеми
// предложениями (Комплекс / НоваяТД / Проблема / ТолькоОбеспечение).
//
// Параметры:
//   ТаблицаCSV - ТаблицаЗначений - результат ПрочитатьCSVФайл()
//
// Возвращаемое значение:
//   ТаблицаЗначений - структура как у СоздатьТаблицуПредложений()
//
Функция СопоставитьСДокументами(ТаблицаCSV) Экспорт

	Предложения = СоздатьТаблицуПредложений();

	МассивНомеровДДП = Новый Массив;
	Для Каждого СтрокаCSV Из ТаблицаCSV Цикл
		Если ЗначениеЗаполнено(СтрокаCSV.НомерДДПТД) Тогда
			МассивНомеровДДП.Добавить(СтрокаCSV.НомерДДПТД);
		КонецЕсли;
	КонецЦикла;

	СоответствиеНайденных = НайтиДокументыПоНомерамГТД(МассивНомеровДДП);

	Для Каждого СтрокаCSV Из ТаблицаCSV Цикл
		СтрокаПредложения = Предложения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПредложения, СтрокаCSV);
		СтрокаПредложения.Выбрать = Истина;
		СтрокаПредложения.Примечание = "";

		Если НЕ ЗначениеЗаполнено(СтрокаCSV.РегНомерТД) Тогда
			СтрокаПредложения.Категория = "Проблема";
			СтрокаПредложения.Выбрать = Ложь;
			СтрокаПредложения.Примечание = "Пустой регистрационный номер ТД (col #12)";
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаCSV.НомерДДПТД) Тогда
			Найденное = СоответствиеНайденных.Получить(СтрокаCSV.НомерДДПТД);
			Если Найденное <> Неопределено Тогда
				СтрокаПредложения.Категория = "Комплекс";
				СтрокаПредложения.СсылкаДокумент = Найденное.Ссылка;
				СтрокаПредложения.НомерСтрокиТЧ = Найденное.НомерСтроки;
			Иначе
				СтрокаПредложения.Категория = "Проблема";
				СтрокаПредложения.Выбрать = Ложь;
				СтрокаПредложения.Примечание = "Номер ДДП указан, но документ не найден в 1С";
			КонецЕсли;
		Иначе
			СтрокаПредложения.Категория = "НоваяТД";
		КонецЕсли;
	КонецЦикла;

	ДобавитьПредложенияТолькоОбеспечение(Предложения);

	Возврат Предложения;

КонецФункции

// Применить предложения: обогатить существующие строки, создать новые документы,
// проставить ТолькоОбеспечение. Всё в транзакции.
//
// Параметры:
//   ТаблицаПредложений - ТаблицаЗначений - все категории, только строки с Выбрать=Истина обрабатываются
//
// Возвращаемое значение:
//   Структура:
//     * Обогащено - Число
//     * Создано - Число
//     * ПомеченоТолькоОбеспечение - Число
//     * Ошибки - Массив
//
Функция ПрименитьКлассификацию(ТаблицаПредложений) Экспорт

	Результат = Новый Структура("Обогащено, Создано, ПомеченоТолькоОбеспечение, Ошибки", 0, 0, 0, Новый Массив);

	НачатьТранзакцию();
	Попытка
		Для Каждого Строка Из ТаблицаПредложений Цикл
			Если НЕ Строка.Выбрать Тогда
				Продолжить;
			КонецЕсли;

			Если Строка.Категория = "Комплекс" Тогда
				Если ОбогатитьСуществующуюСтроку(Строка, Результат.Ошибки) Тогда
					Результат.Обогащено = Результат.Обогащено + 1;
				КонецЕсли;
			ИначеЕсли Строка.Категория = "НоваяТД" Тогда
				Если СоздатьНовыйДокументТД(Строка, Результат.Ошибки) Тогда
					Результат.Создано = Результат.Создано + 1;
				КонецЕсли;
			ИначеЕсли Строка.Категория = "ТолькоОбеспечение" Тогда
				Если ПометитьСтрокуТолькоОбеспечение(Строка, Результат.Ошибки) Тогда
					Результат.ПомеченоТолькоОбеспечение = Результат.ПомеченоТолькоОбеспечение + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Ошибки.Добавить("Транзакция отменена: " + ОписаниеОшибки());
	КонецПопытки;

	ЗаписьЖурналаРегистрации(
		"РусскийТранзит.ЗагрузкаРееструТД.Применение",
		УровеньЖурналаРегистрации.Информация,
		,
		,
		СтрШаблон("Обогащено=%1, Создано=%2, ТолькоОбеспечение=%3, Ошибок=%4",
			Результат.Обогащено, Результат.Создано, Результат.ПомеченоТолькоОбеспечение, Результат.Ошибки.Количество()));

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Разбирает одну строку CSV, учитывая кавычки и экранирование "".
Функция РазобратьСтрокуCSV(Строка)

	Поля = Новый Массив;
	ТекущееПоле = "";
	ВнутриКавычек = Ложь;
	Позиция = 1;
	ДлинаСтроки = СтрДлина(Строка);

	Пока Позиция <= ДлинаСтроки Цикл
		Символ = Сред(Строка, Позиция, 1);

		Если Символ = """" Тогда
			СледующийСимвол = ?(Позиция < ДлинаСтроки, Сред(Строка, Позиция + 1, 1), "");
			Если ВнутриКавычек И СледующийСимвол = """" Тогда
				ТекущееПоле = ТекущееПоле + """";
				Позиция = Позиция + 2;
				Продолжить;
			КонецЕсли;
			ВнутриКавычек = НЕ ВнутриКавычек;
		ИначеЕсли Символ = ";" И НЕ ВнутриКавычек Тогда
			Поля.Добавить(ТекущееПоле);
			ТекущееПоле = "";
		Иначе
			ТекущееПоле = ТекущееПоле + Символ;
		КонецЕсли;

		Позиция = Позиция + 1;
	КонецЦикла;

	Поля.Добавить(ТекущееПоле);
	Возврат Поля;

КонецФункции

Функция СоздатьТаблицуCSV()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("СтатусПроцесса", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("РегНомерТД", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ТС", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Декларант", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("НаименованиеПолучателя", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("НомерДДПТД", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("КоличествоКодовТНВЭД", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ИННПолучателя", Новый ОписаниеТипов("Строка"));
	Возврат Таблица;

КонецФункции

Функция СоздатьТаблицуПредложений()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Выбрать", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Категория", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("РегНомерТД", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("НомерДДПТД", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Декларант", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("КоличествоКодовТНВЭД", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("СсылкаДокумент", Новый ОписаниеТипов("ДокументСсылка.ОперацияПоПоручительству"));
	Таблица.Колонки.Добавить("НомерСтрокиТЧ", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ИННПолучателя", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("НаименованиеПолучателя", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("СтатусПроцесса", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ТС", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Примечание", Новый ОписаниеТипов("Строка"));
	Возврат Таблица;

КонецФункции

Процедура ДобавитьСтрокуВТаблицу(Таблица, Поля)

	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Подразделение = ПолучитьПоле(Поля, 4);
	НоваяСтрока.СтатусПроцесса = ПолучитьПоле(Поля, 6);
	НоваяСтрока.РегНомерТД = СокрЛП(ПолучитьПоле(Поля, 12));
	НоваяСтрока.ТС = ПолучитьПоле(Поля, 13);
	НоваяСтрока.Декларант = ПолучитьПоле(Поля, 15);
	НоваяСтрока.НаименованиеПолучателя = ПолучитьПоле(Поля, 16);
	НоваяСтрока.ДатаВыпуска = РазобратьДату(ПолучитьПоле(Поля, 28));
	НоваяСтрока.НомерДДПТД = СокрЛП(ПолучитьПоле(Поля, 33));
	НоваяСтрока.КоличествоКодовТНВЭД = РазобратьЧисло(ПолучитьПоле(Поля, 45));
	НоваяСтрока.ИННПолучателя = СокрЛП(ПолучитьПоле(Поля, 47));

КонецПроцедуры

Функция ПолучитьПоле(Поля, Индекс)

	Если Индекс >= Поля.Количество() Тогда
		Возврат "";
	КонецЕсли;
	Возврат Поля[Индекс];

КонецФункции

Функция РазобратьДату(Значение)

	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат '00010101';
	КонецЕсли;

	ЗначениеОчищенное = СокрЛП(Значение);
	Части = СтрРазделить(ЗначениеОчищенное, ".", Ложь);
	Если Части.Количество() < 3 Тогда
		Возврат '00010101';
	КонецЕсли;

	Попытка
		СтрокаISO = Части[2] + Формат(Число(Части[1]), "ЧЦ=2; ЧВН=; ЧН=0")
			+ Формат(Число(Части[0]), "ЧЦ=2; ЧВН=; ЧН=0");
		Возврат Дата(СтрокаISO);
	Исключение
		Возврат '00010101';
	КонецПопытки;

КонецФункции

Функция РазобратьЧисло(Значение)

	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат 0;
	КонецЕсли;

	ЗначениеОчищенное = СокрЛП(Значение);
	ЗначениеОчищенное = СтрЗаменить(ЗначениеОчищенное, ",", ".");
	ЗначениеОчищенное = СтрЗаменить(ЗначениеОчищенное, " ", "");

	Попытка
		Возврат Число(ЗначениеОчищенное);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

// Построить карту НомерГТД → {Ссылка, НомерСтроки} из ТЧ ДанныеДокументов.
Функция НайтиДокументыПоНомерамГТД(МассивНомеров)

	Результат = Новый Соответствие;
	Если МассивНомеров.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДД.Ссылка КАК Ссылка,
	|	ДД.НомерСтроки КАК НомерСтроки,
	|	ДД.НомерГТД КАК НомерГТД
	|ИЗ
	|	Документ.ОперацияПоПоручительству.ДанныеДокументов КАК ДД
	|ГДЕ
	|	ДД.НомерГТД В (&МассивНомеров)";
	Запрос.УстановитьПараметр("МассивНомеров", МассивНомеров);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Результат.Получить(Выборка.НомерГТД) = Неопределено Тогда
			Запись = Новый Структура("Ссылка, НомерСтроки", Выборка.Ссылка, Выборка.НомерСтроки);
			Результат.Вставить(Выборка.НомерГТД, Запись);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Найти строки ТЧ ДанныеДокументов, у которых НомерГТД не встретился в CSV (категория ТолькоОбеспечение).
// Ограничиваем периодом: только документы, чья дата попадает в диапазон CSV.
Процедура ДобавитьПредложенияТолькоОбеспечение(Предложения)

	СобранныеНомера = Новый Массив;
	ДатаМин = Неопределено;
	ДатаМакс = Неопределено;
	Для Каждого Строка Из Предложения Цикл
		Если Строка.Категория = "Комплекс" И ЗначениеЗаполнено(Строка.НомерДДПТД) Тогда
			СобранныеНомера.Добавить(Строка.НомерДДПТД);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.ДатаВыпуска) Тогда
			Если ДатаМин = Неопределено ИЛИ Строка.ДатаВыпуска < ДатаМин Тогда
				ДатаМин = Строка.ДатаВыпуска;
			КонецЕсли;
			Если ДатаМакс = Неопределено ИЛИ Строка.ДатаВыпуска > ДатаМакс Тогда
				ДатаМакс = Строка.ДатаВыпуска;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ДатаМин = Неопределено Или ДатаМакс = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДД.Ссылка КАК Ссылка,
	|	ДД.НомерСтроки КАК НомерСтроки,
	|	ДД.НомерГТД КАК НомерГТД,
	|	ДД.ТипУчета КАК ТипУчета,
	|	ДД.ДатаОформления КАК ДатаОформления,
	|	ДД.Декларант КАК Декларант
	|ИЗ
	|	Документ.ОперацияПоПоручительству.ДанныеДокументов КАК ДД
	|ГДЕ
	|	ДД.ДатаОформления МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (НЕ ДД.НомерГТД В (&СобранныеНомера))
	|	И ДД.ТипУчета = ЗНАЧЕНИЕ(Перечисление.ТипыУчетаКлиентов.ПустаяСсылка)";

	Запрос.УстановитьПараметр("ДатаНачала", ДатаМин);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаМакс));
	Запрос.УстановитьПараметр("СобранныеНомера", СобранныеНомера);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Предложения.Добавить();
		НоваяСтрока.Выбрать = Ложь;
		НоваяСтрока.Категория = "ТолькоОбеспечение";
		НоваяСтрока.СсылкаДокумент = Выборка.Ссылка;
		НоваяСтрока.НомерСтрокиТЧ = Выборка.НомерСтроки;
		НоваяСтрока.РегНомерТД = СокрЛП(Выборка.НомерГТД);
		НоваяСтрока.ДатаВыпуска = Выборка.ДатаОформления;
		НоваяСтрока.Примечание = "Строка ТЧ есть в базе, но не встретилась в CSV - вероятно ТолькоОбеспечение";
	КонецЦикла;

КонецПроцедуры

Функция ОбогатитьСуществующуюСтроку(ПредложенияСтрока, МассивОшибок)

	Если НЕ ЗначениеЗаполнено(ПредложенияСтрока.СсылкаДокумент) ИЛИ ПредложенияСтрока.НомерСтрокиТЧ = 0 Тогда
		МассивОшибок.Добавить(СтрШаблон("Комплекс: %1 - нет ссылки на документ или номер строки", ПредложенияСтрока.НомерДДПТД));
		Возврат Ложь;
	КонецЕсли;

	Попытка
		ОбъектДокумента = ПредложенияСтрока.СсылкаДокумент.ПолучитьОбъект();
		Если ОбъектДокумента = Неопределено Тогда
			МассивОшибок.Добавить(СтрШаблон("Комплекс: документ %1 недоступен", ПредложенияСтрока.СсылкаДокумент));
			Возврат Ложь;
		КонецЕсли;

		Если ОбъектДокумента.ДанныеДокументов.Количество() < ПредложенияСтрока.НомерСтрокиТЧ Тогда
			МассивОшибок.Добавить(СтрШаблон("Комплекс: строка %1 не найдена в ТЧ", ПредложенияСтрока.НомерСтрокиТЧ));
			Возврат Ложь;
		КонецЕсли;

		СтрокаТЧ = ОбъектДокумента.ДанныеДокументов[ПредложенияСтрока.НомерСтрокиТЧ - 1];
		СтрокаТЧ.ТипУчета = Перечисления.ТипыУчетаКлиентов.Комплекс;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДатаОформления) И ЗначениеЗаполнено(ПредложенияСтрока.ДатаВыпуска) Тогда
			СтрокаТЧ.ДатаОформления = ПредложенияСтрока.ДатаВыпуска;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПредложенияСтрока.КоличествоКодовТНВЭД) Тогда
			СтрокаТЧ.КоличествоУникальныхКодовТНВЭД = ПредложенияСтрока.КоличествоКодовТНВЭД;
		КонецЕсли;

		ОбъектДокумента.Записать();
		Возврат Истина;
	Исключение
		МассивОшибок.Добавить(СтрШаблон("Комплекс %1: %2", ПредложенияСтрока.НомерДДПТД, ОписаниеОшибки()));
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция СоздатьНовыйДокументТД(ПредложенияСтрока, МассивОшибок)

	Попытка
		НовыйДокумент = Документы.ОперацияПоПоручительству.СоздатьДокумент();
		НовыйДокумент.Дата = ?(ЗначениеЗаполнено(ПредложенияСтрока.ДатаВыпуска),
			ПредложенияСтрока.ДатаВыпуска, ТекущаяДатаСеанса());
		НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийПоручительства.ТДФайл;
		НовыйДокумент.СуммаОбеспечения = 0;
		НовыйДокумент.СуммаДокумента = 0;
		НовыйДокумент.НомерГТД = ПредложенияСтрока.РегНомерТД;

		НоваяСтрокаТЧ = НовыйДокумент.ДанныеДокументов.Добавить();
		НоваяСтрокаТЧ.НомерГТД = ПредложенияСтрока.РегНомерТД;
		НоваяСтрокаТЧ.ТипУчета = Перечисления.ТипыУчетаКлиентов.ТолькоТД;
		НоваяСтрокаТЧ.ДатаОформления = ПредложенияСтрока.ДатаВыпуска;
		НоваяСтрокаТЧ.КоличествоУникальныхКодовТНВЭД = ПредложенияСтрока.КоличествоКодовТНВЭД;

		НовыйДокумент.Записать();
		Возврат Истина;
	Исключение
		МассивОшибок.Добавить(СтрШаблон("НоваяТД %1: %2", ПредложенияСтрока.РегНомерТД, ОписаниеОшибки()));
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция ПометитьСтрокуТолькоОбеспечение(ПредложенияСтрока, МассивОшибок)

	Если НЕ ЗначениеЗаполнено(ПредложенияСтрока.СсылкаДокумент) ИЛИ ПредложенияСтрока.НомерСтрокиТЧ = 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
		ОбъектДокумента = ПредложенияСтрока.СсылкаДокумент.ПолучитьОбъект();
		Если ОбъектДокумента = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;

		Если ОбъектДокумента.ДанныеДокументов.Количество() < ПредложенияСтрока.НомерСтрокиТЧ Тогда
			Возврат Ложь;
		КонецЕсли;

		СтрокаТЧ = ОбъектДокумента.ДанныеДокументов[ПредложенияСтрока.НомерСтрокиТЧ - 1];
		СтрокаТЧ.ТипУчета = Перечисления.ТипыУчетаКлиентов.ТолькоОбеспечение;
		ОбъектДокумента.Записать();
		Возврат Истина;
	Исключение
		МассивОшибок.Добавить(СтрШаблон("ТолькоОбеспечение %1[%2]: %3", ПредложенияСтрока.СсылкаДокумент, ПредложенияСтрока.НомерСтрокиТЧ, ОписаниеОшибки()));
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#КонецЕсли
